Repository: WordPressBugBounty/plugins-paymob-for-woocommerce
Catalog: paymob-for-woocommerce/i18n/languages/paymob-woocommerce-*.po
Languages: ar

source: Paymob for WooCommerce
ar: باي موب للووكوميرس

source: PayMob Payment Gateway Integration for WooCommerce.
ar: طريقة الدفع من خلال ماي موب للووكويرس.

source: Paymob Plugins Team
ar: فريق عمل ماي موب

source: Enable Paymob payment method
ar: تفعيل طريقه الدفع لباي موب

source: Merchant configuration:
ar: تعريفات التاجر:

source: Please, ensure using the secret and public keys that are exists in Paymob <a href="https://accept.paymob.com/portal2/en/settings">merchant account. </a><br/>For testing purposes, you can use secret and public test keys that exist in the same account
ar: يرجى التأكد من استخدام المفاتيح السرية والعامة الموجودة في <a href="https://accept.paymob.com/portal2/en/settings">حساب التاجر Paymob.</a><br/> لأغراض الاختبار، يمكنك استخدام مفاتيح الاختبار السرية والعامة الموجودة في نفس الحساب

source: Secret Key
ar: الرمز السري

source: Public Key
ar: الرمز العام

source: API Key
ar: رمز التكامل

source: Validate PayMob API Key
ar: التحقق من رمز التكامل

source: HMAC Key
ar: رمز ال HMAC

source: Integration ID(s)
ar: أرقام طرق الدفع

source: Title
ar: العنوان

source: This controls the title which the user sees during checkout.
ar: يتحكم هذا في العنوان الذي يراه المستخدم أثناء الخروج لصفحه الدفع.

source: Pay with Paymob
ar: الدفع عن طريق باي موب

source: Description
ar: الوصف

source: This controls the description which the user sees during checkout.
ar: يتحكم هذا في الوصف الذي يراه المستخدم أثناء الخروج لصفحه الدفع.

source: Logo URL
ar: رابط الايقونه / شعار

source: Add a Logo URL for checkout icon.
ar: أضف رابط أيقونه / شعار الذي سوف يراه المستخدم في صفحه الدفع.

source: Integration Callback
ar: رابط رجوع التكامل

source: Please click on this icon
ar: الرجاء الضغط على هذا الرمز

source: to copy the callback URLs and paste it into paymob account.
ar: لنسخ رابط عوده التكامل ولصقها في حساب باي موب.

source: Empty cart items
ar: مسح عناصر سلة التسوق

source: Enable empty cart items
ar: تفعيل خاصيه مسح عناصر سلة التسوق

source: You can check this option in case you need to clear the cart items before completing the payment. (not recommended)
ar: يمكنك تحديد هذا الخيار في حال احتجت إلى مسح عناصر سلة التسوق قبل إتمام الدفع. (لا ينصح)

source: Debug Log
ar: خاصيه التسجيل

source: Enable debug log
ar: تفعيل خاصيه التسجيل

source: Log file will be saved in
ar: ملف التسجيل يتم حفظه في

source: Pass Item Data
ar: بيانات العناصر

source: To display item-level details of the products during checkout, Enable the Checkbox here && navigate to the Paymob Merchant Dashboard,<br/> go to Checkout Customization -> Payment Methods, enable the Show Item/Product option, and then click Apply Changes to save the settings.
ar: لعرض تفاصيل المنتجات على مستوى السلعة أثناء الدفع، قم بتمكين خانة الاختيار هنا وانتقل إلى لوحة التحكم,<br/> go to Checkout Customization -> Payment Methods, enable the Show Item/Product option, and then click Apply Changes to save the settings.

source: Main configuration
ar: الاعدادات الرئيسية

source: Paymob : Awaiting Payment
ar: باي موب: في إنتظار الدفع

source: Order
ar: الطلب

source: Ops. you are accessing wrong order.
ar: عذراً، يتم إختراق بيانات طلب خاطئه.

source: Pay With Paymob
ar: الدفع عن طريق باي موب

source: Paymob payment.
ar: باي موب للدفع.

source: Please ensure you are entering API, public and secret keys. Also, ensure to select at least one of the integration IDs..
ar: يرجي التأكد من إدخال رمز التكامل، الرمز السري، الرمز العام. و كذلك، إختيار طريقه دفع واحده علي اﻷقل.

source: API documentation
ar: الروابط التقنبه

source: Customer support
ar: الدعم الفني

source: Sorry, PayMob plugin requires WooCommerce to be installed and active.
ar: عذرًا، تتطلب إضاقة باي موب تثبيت الووكوميرس وتنشيطه.

source: PayMob Settings
ar: إعدادات باي موب

source: Paymob Webhook: Transaction Approved
ar: Paymob Webhook: تم قبول معامله الدفع

source: Paymob Webhook: Payment Refunded
ar: Paymob Webhook: تم إسترداد الدفع

source: Paymob Webhook: Payment is not completed
ar: Paymob Webhook: لم يكتمل الدفع

source: Sorry, you are accessing wrong data
ar: عذرًا، أنت تقوم بالوصول إلى بيانات خاطئة

source: Paymob : Transaction
ar: باي موب : المعامله

source: Payment is not completed due to
ar: لم يكتمل الدفع بسبب

source: Merchant configuration
ar: تعريفات التاجر

source: Enable
ar: اظهار

source: Payment Method
ar: طريقة الدفع

source: sectionend
ar: الاقسام

source: Payment Method - Logo URL
ar: رابط ايقونه وسيله الدفع

source: Payment Method - Description
ar: وصف وسيله الدفع

source: Payment Method - Title
ar: عنوان وسيله الدفع

source: Paymob Integration ID
ar: رمز تكامل باي موب

source: Re-Order
ar: اعادة ترتيب

source: Enable / Disable
ar: اظهار/اخفاء

source: Logo
ar: ايقونة

source: Action
ar: تفعيل

source: Loading...
ar: تحميل...

source: Add Payment Integration
ar: اضافة وسيلة دفع

source: Payment Integrations
ar: طرق الدفع

source: Integration ID
ar: تكامل الدفع

source: List of Payment Method Integrations
ar: طرق الدفع

source: Accept payment through Paymob payment provider.
ar: الدفع من خلال باي موب.

source: Paymob
ar: باي موب

source: At least one Payment Method should be enabled below Paymob.
ar: يجب تمكين طريقة دفع واحدة على الأقل أسفل باي موب.

source: Step 1: Register with Paymob
ar: الخطوة 1: التسجيل في باي موب

source: Before beginning the configuration, you must have a Paymob Account. Please register or login to your account using the below link:
ar: قبل البدء في التكوين، يجب أن يكون لديك حساب في باي موب. يرجى التسجيل أو تسجيل الدخول إلى حسابك باستخدام الرابط أدناه:

source: Once registered or logged in, you will gain access to the Test Mode Environment on the Merchant Dashboard.
ar: بمجرد التسجيل أو تسجيل الدخول، ستتمكن من الوصول إلى تغير وضع التيست على لوحة معلومات التاجر.

source: Step 2: Contact Paymob Support
ar: الخطوة 2: اتصل بدعم باي موب

source: Email Paymob at <a href="mailto:support@paymob.com">support@paymob.com</a> to get assistance from the Sales Team for further onboarding.
ar: أرسل بريدًا إلكترونيًا إلى باي موب<a href="mailto:support@paymob.com">support@paymob.com</a> للحصول ع مزيد من المتابعه من فريق المبيعات.

source: Step 3: Key Configurations
ar: الخطوة 3: اعدادات طرق الدفع

source: Your dashboard has Test Mode and Live Mode options. Live Mode will be activated only when you have at least one live payment method integration.
ar: تحتوي لوحة التحكم الخاصة بك على خياري وضع التيست والوضع اللايف. سيتم تنشيط الوضع اللايف فقط عندما يكون لديك تكامل واحد على الأقل لطريقة دفع مباشرة.

source: Test Mode: Use this to perform test transactions.
ar: وضع التيست: استخدم هذا لإجراء معاملات الاختبار.

source: Live Mode: Use this for live transactions.
ar: الوضع اللايف: استخدم هذا للمعاملات المباشرة.

source: How to Access the Keys:
ar: كيفية الوصول إلى المفاتيح:

source: Log in to the Merchant Dashboard.
ar: تسجيل الدخول إلى لوحة معلومات التاجر.

source: Click on the "Settings" tab and navigate to the "Account Info" section.
ar: انقر علي الإعدادات وانتقل إلى قسم معلومات الحساب .

source: Click the "view" button next to each key (API Key, Public Key, Secret Key) to reveal them.
ar: (API Key, Public Key, Secret Key) لاظهارهانقر فوق زر عرض بجوار كل مفتاح.

source: Copy and paste these keys into the Configuration Page.
ar: انسخ هذه المفاتيح وألصقها في صفحة التكوين.

source: Note: API Key, Public Key, and Secret Key differ between Test and Live Modes. Always use LIVE Keys for live transactions and TEST Keys for test transactions.
ar: ملاحظة: يختلف مفتاح API والمفتاح العام والمفتاح السري بين وضعي الاختبار والمباشر. استخدم دائمًا مفاتيح LIVE للمعاملات المباشرة ومفاتيح TEST للمعاملات الاختبارية.

source: Step 4: Configure Callback URL
ar: الخطوة 4: تكوين رابط الرجوع

source: Click the icon <span style="cursor:pointer;" id="cpicon" class="dashicons dashicons-clipboard"></span> to copy the callback URL.
ar: انقر فوق الرمز <span style="cursor:pointer;" id="cpicon" class="dashicons dashicons-clipboard"></span> لنسخ عنوان URL للاتصال العكسي.

source: Log in to the Paymob Merchant Dashboard.
ar: قم بتسجيل الدخول إلى لوحة معلومات التاجر في باي موب.

source: Go to the "Developers" section and select "Payment Integrations."
ar: انتقل إلى قسم المطورون وحدد تكاملات الدفع.

source: Click on the ID of each payment method integration, select "Edit," and paste the URL into both the "Transaction Processed Callback" and "Transaction Response Callback" fields.
ar: انقر فوق معرف كل تكامل لطريقة الدفع، وحدد تحرير، ثم الصق عنوان URL في الحقلين مكالمة معالجة المعاملة ومكالمة استجابة المعاملة.

source: Click "Submit."
ar: انقر"ارسال"

source: Repeat these steps for each payment integration. If you add new payment methods in the future, ensure you update the URL accordingly.
ar: كرر هذه الخطوات لكل عملية تكامل للدفع. إذا أضفت طرق دفع جديدة في المستقبل، فتأكد من تحديث عنوان URL وفقًا لذلك.

source: Step 5: Show Item/Product Details on Paymob Checkout ( Optional )
ar: الخطوة 5: إظهار تفاصيل المنتج/العنصر عند إتمام عملية الدفع عبر باي موب(اختياري)

source: Enable the checkbox in this section.
ar: قم بتمكين مربع الاختيار في هذا القسم.

source: Navigate to "Checkout Customization" → "Payment Methods."
ar: انتقل الي صفحة الدفع الي طرق الدفع

source: Under the "Additional Information" section, enable the "Show Item/Product" option and click "Apply Changes."
ar: تحت قسم المعلومات الإضافية، قم بتمكين خيار إظهار العنصر/المنتج وانقر فوق تطبيق التغييرات.

source: Step 6 - Miscellaneous ( Optional )
ar: الخطوة 6 - متفرقات (اختياري)

source: Enabling the Debug Log checkbox in this section will log all actions in Paymob files. These files will be saved in the directory
ar: سيؤدي تمكين مربع الاختيار سجل التصحيح في هذا القسم إلى تسجيل جميع الإجراءات في ملفات باي موب سيتم حفظ هذه الملفات في الدليل

source: Enabling the Empty cart items checkbox in this section will clear the cart items before completing the payment. (not recommended).
ar: سيؤدي تفعيل مربع الاختيار إفراغ عناصر سلة التسوق في هذا القسم إلى مسح عناصر سلة التسوق قبل إكمال الدفع. (غير مستحسن).

source: Step 7: Save Changes
ar: الخطوة 7: حفظ التغييرات

source: Click "Save Changes." After saving, you will be redirected to the "Payment Integrations Page," where you can view all the payment methods integrated with Paymob.
ar: انقر فوق حفظ التغييرات. بعد الحفظ، سيتم إعادة توجيهك إلى صفحة تكاملات الدفع، حيث يمكنك عرض جميع طرق الدفع المتكاملة مع باي موب.
